# regions_dict.py
regions_dict = {
    'Ленинградская область': {
        'districts': {
            "выборгский":  ("Ленинградская область", "Санкт-Петербург", "Выборгский"),
            "адмиралтейский": ("Ленинградская область", "Санкт-Петербург", "Адмиралтейский"),
            "василеостровский": ("Ленинградская область", "Санкт-Петербург", "Василеостровский"),
            "калининский": ("Ленинградская область", "Санкт-Петербург", "Калининский"),
            "кировский": ("Ленинградская область", "Санкт-Петербург", "Кировский"),
            "колпинский": ("Ленинградская область", "Санкт-Петербург", "Колпинский"),
            "красногвардейский": ("Ленинградская область", "Санкт-Петербург", "Красногвардейский"),
            "красносельский": ("Ленинградская область", "Санкт-Петербург", "Красносельский"),
            "кронштадтский": ("Ленинградская область", "Санкт-Петербург", "Кронштадтский"),
            "курортный": ("Ленинградская область", "Санкт-Петербург", "Курортный"),
            "московский": ("Ленинградская область", "Санкт-Петербург", "Московский"),
            "невский": ("Ленинградская область", "Санкт-Петербург", "Невский"),
            "петроградский": ("Ленинградская область", "Санкт-Петербург", "Петроградский"),
            "приморский": ("Ленинградская область", "Санкт-Петербург", "Приморский"),
            "пушкинский": ("Ленинградская область", "Санкт-Петербург", "Пушкинский"),
            "фрунзенский": ("Ленинградская область", "Санкт-Петербург", "Фрунзенский"),
            "центральный": ("Ленинградская область", "Санкт-Петербург", "Центральный"),
            "петродворцовый": ("Ленинградская область", "Санкт-Петербург", "Петродворцовый"),
        },
        'areas': {
            "всеволожский": ("Ленинградская область", "Всеволожский", None),
            "гатчинский": ("Ленинградская область", "Гатчинский", None),
            "выборгский": ("Ленинградская область", "Выборгский", None),
            "бокситогорский": ("Ленинградская область", "Бокситогорский", None),
            "волосовский": ("Ленинградская область", "Волосовский", None),
            "волховский": ("Ленинградская область", "Волховский", None),
            "кингисеппский": ("Ленинградская область", "Кингисеппский", None),
            "киришский": ("Ленинградская область", "Киришский", None),
            "кировский": ("Ленинградская область", "Кировский", None),
            "лодейнопольский": ("Ленинградская область", "Лодейнопольский", None),
            "ломоносовский": ("Ленинградская область", "Ломоносовский", None),
            "лужский": ("Ленинградская область", "Лужский", None),
            "подпорожский": ("Ленинградская область", "Подпорожский", None),
            "приозерский": ("Ленинградская область", "Приозерский", None),
            "сланцевский": ("Ленинградская область", "Сланцевский", None),
            "тихвинский": ("Ленинградская область", "Тихвинский", None),
            "тосненский": ("Ленинградская область", "Тосненский", None),
            "мурино": ("Ленинградская область", "Всеволожский", None),
            "кудрово": ("Ленинградская область", "Всеволожский", None),
            "спб": ("Ленинградская область", "Санкт-Петербург", None),
            "питер": ("Ленинградская область", "Санкт-Петербург", None),
            "санкт-петербург": ("Ленинградская область", "Санкт-Петербург", None),
        }
    },
    'Московская область': {
        'districts': {
            # Здесь могут быть районы Москвы
        },
        'areas': {
            # Здесь могут быть районы Московской области
        }
    },
    # Добавить другие области и их районы и районы главных городов по необходимости
}